; domain
(define (domain Depot)
(:requirements :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z))))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))

)

; problem
(define (problem depotprob7654) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate4)
	(at pallet1 depot1)
	(clear crate8)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate9)
	(at pallet4 distributor1)
	(clear crate7)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 distributor2)
	(clear crate3)
	(at pallet7 depot1)
	(clear pallet7)
	(at pallet8 distributor1)
	(clear crate0)
	(at pallet9 depot0)
	(clear crate5)
	(at truck0 depot1)
	(at truck1 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 distributor1)
	(on crate0 pallet8)
	(at crate1 depot0)
	(on crate1 pallet9)
	(at crate2 distributor0)
	(on crate2 pallet3)
	(at crate3 distributor2)
	(on crate3 pallet6)
	(at crate4 depot0)
	(on crate4 pallet0)
	(at crate5 depot0)
	(on crate5 crate1)
	(at crate6 distributor1)
	(on crate6 pallet4)
	(at crate7 distributor1)
	(on crate7 crate6)
	(at crate8 depot1)
	(on crate8 pallet1)
	(at crate9 distributor0)
	(on crate9 crate2)
)

(:goal (and
		(on crate1 pallet8)
		(on crate2 pallet3)
		(on crate4 pallet0)
		(on crate5 pallet5)
		(on crate6 pallet1)
		(on crate7 crate6)
		(on crate9 crate7)
	)
)(:metric minimize (total-time)))

; plan
1. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 3 of 7
2. (lift hoist0 crate5 crate1 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate1)
   added: (lifting hoist0 crate5) (clear crate1)
   goals met: 3 of 7
3. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   goals met: 3 of 7
4. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 3 of 7
5. (lift hoist3 crate9 crate2 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist3) (on crate9 crate2)
   added: (lifting hoist3 crate9) (clear crate2)
   goals met: 3 of 7
6. (load hoist3 crate9 truck1 distributor0)
   deleted: (lifting hoist3 crate9)
   added: (in crate9 truck1) (available hoist3)
   goals met: 3 of 7
7. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 3 of 7
8. (lift hoist4 crate7 crate6 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist4) (on crate7 crate6)
   added: (lifting hoist4 crate7) (clear crate6)
   goals met: 2 of 7
9. (load hoist4 crate7 truck1 distributor1)
   deleted: (lifting hoist4 crate7)
   added: (in crate7 truck1) (available hoist4)
   goals met: 2 of 7
10. (lift hoist4 crate6 pallet4 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist4) (on crate6 pallet4)
   added: (lifting hoist4 crate6) (clear pallet4)
   goals met: 2 of 7
11. (load hoist4 crate6 truck1 distributor1)
   deleted: (lifting hoist4 crate6)
   added: (in crate6 truck1) (available hoist4)
   goals met: 2 of 7
12. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 2 of 7
13. (lift hoist1 crate8 pallet1 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist1) (on crate8 pallet1)
   added: (lifting hoist1 crate8) (clear pallet1)
   goals met: 2 of 7
14. (drop hoist1 crate8 pallet7 depot1)
   deleted: (lifting hoist1 crate8) (clear pallet7)
   added: (available hoist1) (at crate8 depot1) (clear crate8) (on crate8 pallet7)
   goals met: 2 of 7
15. (unload hoist1 crate6 truck1 depot1)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   goals met: 2 of 7
16. (drop hoist1 crate6 pallet1 depot1)
   deleted: (lifting hoist1 crate6) (clear pallet1)
   added: (available hoist1) (at crate6 depot1) (clear crate6) (on crate6 pallet1)
   goals met: 3 of 7
17. (unload hoist1 crate7 truck1 depot1)
   deleted: (in crate7 truck1) (available hoist1)
   added: (lifting hoist1 crate7)
   goals met: 3 of 7
18. (drop hoist1 crate7 crate6 depot1)
   deleted: (lifting hoist1 crate7) (clear crate6)
   added: (available hoist1) (at crate7 depot1) (clear crate7) (on crate7 crate6)
   goals met: 4 of 7
19. (unload hoist1 crate9 truck1 depot1)
   deleted: (in crate9 truck1) (available hoist1)
   added: (lifting hoist1 crate9)
   goals met: 4 of 7
20. (drop hoist1 crate9 crate7 depot1)
   deleted: (lifting hoist1 crate9) (clear crate7)
   added: (available hoist1) (at crate9 depot1) (clear crate9) (on crate9 crate7)
   goals met: 5 of 7
21. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 5 of 7
22. (lift hoist0 crate1 pallet9 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet9)
   added: (lifting hoist0 crate1) (clear pallet9)
   goals met: 5 of 7
23. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 5 of 7
24. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 5 of 7
25. (lift hoist4 crate0 pallet8 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist4) (on crate0 pallet8)
   added: (lifting hoist4 crate0) (clear pallet8)
   goals met: 5 of 7
26. (load hoist4 crate0 truck1 distributor1)
   deleted: (lifting hoist4 crate0)
   added: (in crate0 truck1) (available hoist4)
   goals met: 5 of 7
27. (unload hoist4 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist4)
   added: (lifting hoist4 crate1)
   goals met: 5 of 7
28. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 5 of 7
29. (unload hoist5 crate5 truck0 distributor2)
   deleted: (in crate5 truck0) (available hoist5)
   added: (lifting hoist5 crate5)
   goals met: 5 of 7
30. (drop hoist5 crate5 pallet5 distributor2)
   deleted: (lifting hoist5 crate5) (clear pallet5)
   added: (available hoist5) (at crate5 distributor2) (clear crate5) (on crate5 pallet5)
   goals met: 6 of 7
31. (drop hoist4 crate1 pallet8 distributor1)
   deleted: (lifting hoist4 crate1) (clear pallet8)
   added: (available hoist4) (at crate1 distributor1) (clear crate1) (on crate1 pallet8)
   goals met: 7 of 7
